read_verilog -sv rtl/matmul_4x4_mmio.sv
hierarchy -top matmul_4x4_mmio
proc
opt
fsm
opt
techmap
opt
stat
write_verilog synth/matmul_4x4_mmio_netlist.v
