read_verilog -sv rtl/matmul_4x4_seq_flat.sv
hierarchy -top matmul_4x4_seq_flat
proc
opt
fsm
opt
techmap
opt
stat
write_verilog synth/matmul_4x4_seq_flat_netlist.v
